Update docs with humanizer
